/**********************************************************************************
  * @brief      : 	JZ2440v2开发板异常调试代码源文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
***********************************************************************************/

#include "uart.h"
#include "my_printf.h"

/**********************************************************************************
  * @brief       : 	打印异常相关信息
  * @param[in]   : 	cpsr   	当前程序状态寄存器的值
  					str		异常提示信息
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void printException(unsigned int cpsr, char *str)
{
	Puts("Exception! cpsr = ");
	printHex(cpsr);
	Puts(" ");
	Puts(str);
	Puts("\n\r");
}

/**********************************************************************************
  * @brief       : 	打印SWI异常相关信息
  * @param[in]   : 	pSWI   	当前SWI的值
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/

void printSWIVal(unsigned int *pSWI)
{
	Puts("SWI val = ");
	printHex(*pSWI & ~0xff000000);
	Puts("\n\r");
}

