/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板使用GPIO模拟SPI代码源文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#include "s3c2440_soc.h"
#include "spi_gpio_simulate.h"


/**********************************************************************************
  * @brief       : 	初始化GPIO管脚用以模拟spi
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void InitSPIGPIO(void)
{
    /* GPF1 OLED_CSn output */
    GPFCON &= ~(3<<(1*2));
    GPFCON |= (1<<(1*2));
    GPFDAT |= (1<<1);

    /* GPG2 FLASH_CSn output
    * GPG4 OLED_DC   output
    * GPG5 SPIMISO   input
    * GPG6 SPIMOSI   output
    * GPG7 SPICLK    output
    */
    GPGCON &= ~((3<<(2*2)) | (3<<(4*2)) | (3<<(5*2)) | (3<<(6*2)) | (3<<(7*2)));
    GPGCON |= ((1<<(2*2)) | (1<<(4*2)) | (1<<(6*2)) | (1<<(7*2)));
    GPGDAT |= (1<<2);
}

/**********************************************************************************
  * @brief       : 	设置SPI时钟
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
static void SPISetCLK(char val)
{
    if (val)
        GPGDAT |= (1<<7);
    else
        GPGDAT &= ~(1<<7);
}

/**********************************************************************************
  * @brief       : 	设置SPI数据输出状态
  * @param[in]   : 	val	待设置的值
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
static void SPISetDO(char val)
{
    if (val)
        GPGDAT |= (1<<6);
    else
        GPGDAT &= ~(1<<6);
}

/**********************************************************************************
  * @brief       : 	设置SPI数据输人状态
  * @param[in]   : 	val	待设置的值
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
static char SPIGetDI(void)
{
    if (GPGDAT & (1<<5))
        return 1;
    else 
        return 0;
}

/**********************************************************************************
  * @brief       : 	发送一个字节的数据
  * @param[in]   : 	val	待发送的值
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void SendByteSPIGPIO(unsigned char val)
{
    int i;
    for (i = 0; i < 8; i++)
    {
        SPISetCLK(0);
        SPISetDO(val & 0x80);
        SPISetCLK(1);
        val <<= 1;
    }  
}

/**********************************************************************************
  * @brief       : 	接收一个字节的数据
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	val	返回接收的一个字节的数据
  * @others      : 	无
***********************************************************************************/
unsigned char RecvByteSPIGPIO(void)
{
    int i;
    unsigned char val = 0;
    for (i = 0; i < 8; i++)
    {
        val <<= 1;
        SPISetCLK(0);
        if (SPIGetDI())
            val |= 1;
        SPISetCLK(1);
    }
    return val;    
}

