/**************************************************************************
  * @brief      :  JZ2440v2开发板ADC采集代码头文件
  * @version    :  V0.0
  * @note       :  无
  * @history    :  无
***************************************************************************/
#ifndef _ADC_H
#define _ADC_H

/**************************************************************************
  * @brief       :  读取ADC转换的数据
  * @param[in]   :  channel 代表ADC的采集通道，取值为 {0,1,2,3,4,5,7}
  * @param[out]  :  无
  * @return      :  ADC读取并转换完成之后的数据
  * @others      :  无
***************************************************************************/
int ReadADC(int channel);

#endif /* _ADC_H */

