/**********************************************************************************
  * @brief      : 	JZ2440v2开发板中断代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
***********************************************************************************/

#ifndef _INTERRUPT_H
#define _INTERRUPT_H

//中断处理函数函数指针类型
typedef void(*IrqFunc)(int);

/**********************************************************************************
  * @brief       : 	JZ2440v2开发板中断函数处理函数
  * @param[in]   : 	irp	待注册的中断函数的中断号
  					fp	待注册的中断函数的函数指针
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void RegisterIrq(int irq, IrqFunc fp);

#endif

