/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板红外接收传感器原始数据代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _IRDA_RAW_H
#define _IRDA_RAW_H

typedef struct SIrdaRawdataEvent {
	int iPol; /* 极性 */
	int iDuration;  /* 脉冲宽度, us */
}SIrdaRawdataEvent, *PSIrdaRawdataEvent;

/**************************************************************************************************
  * @brief		 :	初始化红外接收功能
  * @param[in]	 :	无
  * @param[out]  :	无
  * @return 	 :	无
  * @others 	 :	无
***************************************************************************************************/
void InitIrda(void);

#endif /* _IRDA_RAW_H */

