/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板串口打印調試代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _MY_PRINTF_H
#define _MY_PRINTF_H

#include "uart.h"

#define  __out_putchar  PutChar

#define  MAX_NUMBER_BYTES  64

/**********************************************************************************
  * @brief		 :	向串口輸出标准化字符串（多参数函数）
  * @param[in]	 :	fmt  	带格式的字符串
  					......	多参数
  * @param[out]  :	无
  * @return 	 :	0  无实际意义
  * @others 	 :	无
***********************************************************************************/
int printf(const char *fmt, ...);

/**********************************************************************************
  * @brief		 :	向串口輸出一个十六进制的数
  * @param[in]	 :	val	待输出的数据
  * @param[out]  :	无
  * @return 	 :	无
  * @others 	 :	无
***********************************************************************************/
void printHex(unsigned int val);

#endif /* _MY_PRINTF_H */

