/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板oled显示屏代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef  _OLED_H
#define  _OLED_H

/**********************************************************************************
  * @brief       : 	初始化OLED
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void InitOLED(void);

 /**********************************************************************************
  * @brief		 :	在OLED显示屏上显示特定字符串
  * @param[in]	 :	page	字符串显示的页
  					col		字符串显示的列
  					str		待显示的字符串首地址
  * @param[out]  :	无
  * @return 	 :	无
  * @others 	 :	page: 0-7
					col : 0-127
					字符: 8x16象素
***********************************************************************************/
void PrintOLEDString(int page, int col, char *str);

/**********************************************************************************
  * @brief		 :	在OLED显示屏上显示特定字符
  * @param[in]	 :	page	字符显示的页
  					col		字符显示的列
  					c		待显示的字符
  * @param[out]  :	无
  * @return 	 :	无
  * @others 	 :	page: 0-7
					col : 0-127
					字符: 8x16象素
***********************************************************************************/
void PutOLEDChar(int page, int col, char c);

#endif

