/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板使用GPIO模拟SPI代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _SPI_GPIO_SIMULATE_H
#define _SPI_GPIO_SIMULATE_H

/**********************************************************************************
  * @brief       : 	初始化GPIO管脚用以模拟spi
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void InitSPIGPIO(void);

/**********************************************************************************
  * @brief       : 	发送一个字节的数据
  * @param[in]   : 	val	待发送的值
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void SendByteSPIGPIO(unsigned char val);

/**********************************************************************************
  * @brief       : 	接收一个字节的数据
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	val	返回接收的一个字节的数据
  * @others      : 	无
***********************************************************************************/
unsigned char RecvByteSPIGPIO(void);

#endif

