/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板SPI Flash代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _SPI_FLASH_H
#define _SPI_FLASH_H

/**********************************************************************************
  * @brief       : 	读取SPI Flash的ID
  * @param[in]   : 	无
  * @param[out]  : 	pMID	存放获取的MID
  					pDID	存放获取的DID
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void ReadSPIFlashID(int *pMID, int *pDID);

/**********************************************************************************
  * @brief       : 	初始化SPI Flash
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void InitSPIFlash(void);

/**********************************************************************************
  * @brief       : 	擦除SPI Flash的数据，固定擦除4K内容
  * @param[in]   : 	addr	擦除的首地址
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void EraseSPIFlashSector(unsigned int addr);

/**********************************************************************************
  * @brief       : 	向SPI Flash写入数据
  * @param[in]   : 	addr	写入的首地址
  					buf		待写入的数据缓冲区地址
  					len		待写入的数据长度
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void ProgramSPIFlash(unsigned int addr, unsigned char *buf, int len);

/**********************************************************************************
  * @brief       : 	向SPI Flash读取数据
  * @param[in]   : 	addr	读取的首地址
  					buf		读取的数据存放的缓冲区地址
  					len		待读取的数据长度
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void ReadSPIFlash(unsigned int addr, unsigned char *buf, int len);

/**********************************************************************************
  * @brief       : 	测试用SPI Flash写入函数
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void DoWriteSPIFLASH(void);

/**********************************************************************************
  * @brief       : 	测试用SPI Flash读取函数
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void DoReadSPIFLASH(void);

/**********************************************************************************
  * @brief       : 	测试用SPI Flash擦除函数
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void DoEraseSPIFLASH(void);

#endif

