/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板SPI 控制器代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _SPI_S3C2440_CONTROLLER_H
#define _SPI_S3C2440_CONTROLLER_H

/**********************************************************************************
  * @brief       : 	初始化S3C2440 SPI控制器
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void InitSPIS3c2440Controller(void);

/**********************************************************************************
  * @brief       : 	使用S3C2440 SPI控制器发送一个字节数据
  * @param[in]   : 	val	待发送的数据
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void SendByteSPIS3c2440Controller(unsigned char val);

/**********************************************************************************
  * @brief       : 	使用S3C2440 SPI控制器接收一个字节数据
  * @param[in]   : 	val	待发送的数据
  * @param[out]  : 	无
  * @return      : 	返回接收的一个字节的数据
  * @others      : 	无
***********************************************************************************/
unsigned char RecvByteSPIS3c2440Controller(void);

#endif

