/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板触摸屏代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _TOUCHSCREEN_H
#define _TOUCHSCREEN_H

/**********************************************************************************
  * @brief       : 	初始化触摸屏
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void InitTouchScreen(void);

/**********************************************************************************
  * @brief       : 	读取触摸笔点击的信息
  * @param[in]   : 	无
  * @param[out]  : 	px	存放触摸笔点击的x坐标
  					py	存放触摸笔点击的y坐标
  					ppressure	存放触摸笔压力状态
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void ReadTsRaw(int *px, int *py, int *ppressure);

/**********************************************************************************
  * @brief       : 	上报触摸笔点击的信息
  * @param[in]   : 	x	触摸笔点击的x坐标
  					y	触摸笔点击的y坐标
  					pressure	触摸笔压力状态
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void ReportTsXY(int x, int y, int pressure);

/**********************************************************************************
  * @brief       : 	读取触摸笔点击的信息
  * @param[in]   : 	无
  * @param[out]  : 	px	存放触摸笔点击的x坐标
  					py	存放触摸笔点击的y坐标
  					ppressure	存放触摸笔压力状态
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void ReadTsRaw(int *px, int *py, int *ppressure);

/**********************************************************************************
  * @brief       : 	触摸屏测试函数
  * @param[in]   : 	无
  * @param[out]  : 	无
  * @return      : 	无
  * @others      : 	无
***********************************************************************************/
void TestTouchScreen(void);

#endif /* _TOUCHSCREEN_H */

