/****************************************************************************************************
  * @brief      : 	JZ2440v2开发板触摸屏功能库代码头文件
  * @version    : 	V0.0
  * @note       : 	无
  * @history    : 	无
*****************************************************************************************************/

#ifndef _TSLIB_H
#define _TSLIB_H
#include "function.h"

/**********************************************************************************
  * @brief		 :	触摸屏校准函数
  * @param[in]	 :	无
  * @param[out]  :	tsparam	存放触摸屏校准原始数据
  * @return 	 :	0	校准失败
  					1	校准成功
  * @others 	 :	无
***********************************************************************************/
int CalibrateTs(PSTsParameters tsparam);

/******************************************************************************************************
  * @brief       : 	设置触摸屏校准参数
  * @param[in]   : 	tsparam	触摸屏校准原始参数
  * @param[out]  : 	无
  * @return      : 	0	无实际意义
  * @others      : 	无
********************************************************************************************************/
int SetTsCalibrateParams(PSTsParameters tsparam);

/**********************************************************************************
  * @brief		 :	读TS原始数据, 转换为LCD坐标
  * @param[in]	 :	无
  * @param[out]  :	lcd_x	存放转换完成的lcd x坐标
  					lcd_y	存放转换完成的lcd y坐标
  					lcd_pressure	存放触摸笔的压力状态
  * @return 	 :	1	无数据
  					0	有数据
  * @others 	 :	无
***********************************************************************************/
int ReadTs(int *lcd_x, int *lcd_y, int *lcd_pressure);

#endif

